Public Attributes | List of all members
API_OverrideRule Struct Reference
Graphic Overrides
Represents an override rule. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_Guid  | guid
The unique identifier for the override rule.
GS::UniString  | name
The name of the rule, that is unique within the project.
API_OverrideRuleStyle  | style
Specifies what, and how this rule should override.
GS::UniString  | criterionXML
Specifies when this rule should be used. To get the proper criterion XML, save the configured override rule as XML in Archicad. See the Override_Test add-on about the format of the XML.
Detailed Description
Represents an override rule.
Member Data Documentation
◆ criterionXML
 API_OverrideRule::criterionXML
Specifies when this rule should be used. To get the proper criterion XML, save the configured override rule as XML in Archicad. See the Override_Test add-on about the format of the XML.
◆ guid
 API_OverrideRule::guid
The unique identifier for the override rule.
◆ name
 API_OverrideRule::name
The name of the rule, that is unique within the project.
◆ style
 API_OverrideRule::style
Specifies what, and how this rule should override.